{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ocrlstm0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ocrlstm0_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ocrlstm0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "1", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "squeeze", 
      "name": "ocrlstm0_squeeze0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ocrlstm0_transpose0", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "ocrlstm0_lstm0_swapaxes0", 
      "attrs": {
        "dim1": "0", 
        "dim2": "1"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ocrlstm0_lstm0_l0_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1024, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "ocrlstm0_lstm0_reshape0", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ocrlstm0_lstm0_l0_h2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1024, 256)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "ocrlstm0_lstm0_reshape1", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ocrlstm0_lstm0_l0_i2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1024,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "ocrlstm0_lstm0_reshape2", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ocrlstm0_lstm0_l0_h2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1024,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "ocrlstm0_lstm0_reshape3", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "_rnn_param_concat", 
      "name": "ocrlstm0_lstm0__rnn_param_concat0", 
      "attrs": {
        "dim": "0", 
        "num_args": "4"
      }, 
      "inputs": [[8, 0, 0], [10, 0, 0], [12, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "ocrlstm0_lstm0_ocrlstm0_lstm0_h0_0", 
      "attrs": {
        "__layout__": "LNC", 
        "dtype": "float32", 
        "shape": "(1, 0, 256)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_zeros", 
      "name": "ocrlstm0_lstm0_ocrlstm0_lstm0_h0_1", 
      "attrs": {
        "__layout__": "LNC", 
        "dtype": "float32", 
        "shape": "(1, 0, 256)"
      }, 
      "inputs": []
    }, 
    {
      "op": "RNN", 
      "name": "ocrlstm0_lstm0_rnn0", 
      "attrs": {
        "bidirectional": "False", 
        "mode": "lstm", 
        "num_layers": "1", 
        "p": "0", 
        "state_outputs": "True", 
        "state_size": "256"
      }, 
      "inputs": [[6, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "ocrlstm0_lstm0_swapaxes1", 
      "attrs": {
        "dim1": "0", 
        "dim2": "1"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ocrlstm0_dense0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(4, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ocrlstm0_dense0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(4,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "ocrlstm0_dense0_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "4"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 7, 9, 11, 13, 20, 21], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    21, 
    22, 
    23, 
    24, 
    25
  ], 
  "heads": [[22, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}